# Buttons
ADV_BUTTON_TEXT = "📢Реклама"
QUESTION_BUTTON_TEXT = "🙋‍♂️Задать вопрос"
SERVICES_BUTTON_TEXT = "🛎️Отели, статусы, лаунжи"
REPORT_BUTTON_TEXT = "🤖Сообщить о проблеме"
OTHER_BUTTON_TEXT = "🌀Прочее"
ADV_OFFER_BUTTON_TEXT = "📥Хотим разместиться у вас (узнать условия)"
SPECIAL_OFFER_BUTTON_TEXT = "⭐️Хотим предложить спецпроект"
ADV_IN_CHANNEL_BUTTON_TEXT = "📤Хотим предложить размещение в своём канале"
PUBLIC_QUESTION_BUTTON_TEXT = "🙋Публичный вопрос"
PRIVATE_CONSULTATION_BUTTON_TEXT = "🙈Частная консультация"
BOOK_HOTEL_BUTTON_TEXT = "️🛎Забронировать отель по спецтарифу"
ORDER_STATUS_BUTTON_TEXT = "✨️Приобрести статус"
STATUS_AVOLTA_RADISSON = "😎Radisson VIP + Avolta Platinum"
STATUS_MSC_DIAMOND = "🚢MSC Diamond"
ORDER_LOUNGE_BUTTON_TEXT = "🍸Приобрести проходки в бизнес-залы"
REPORT_BOT_PROBLEM_BUTTON_TEXT = "🤖Проблема с ботом Hilton Negotiated Fares"
ROUTES_PROBLEM_BUTTON_TEXT = "✈️Проблема с routes.de1337ed.ru"
TYPO_PROBLEM_BUTTON_TEXT = "✍️Опечатка/неточность в тексте"

# Main menu replies
WELCOME_MESSAGE = "<b>👋Добрый день, {user_name}!</b>\nПожалуйста, выберите категорию обращения:\n\n - <b>📢Реклама</b>\nПо всем вопросам заказного размещения постов\n<b> - 🙋‍Задать вопрос</b>\nЧтобы отправить вопрос в редакцию по теме канала\n<b> - 🛎Отели, статусы, лаунжи</b>\nРаздел с витриной доступных специальных предложений 🙂\n<b> - 🤖Сообщить о проблеме</b>\nЗдесь можно направить сообщение об ошибке или опечатке в любом из моих сервисов\n - <b>🌀Прочее</b>\nДля всего остального есть <s>mastercard</s> раздел «Прочее».\nЗдесь со мной можно связаться по любым другим вопросам.\n\n⏮️Чтобы вернуться в это меню из любой точки бота, используйте команду /start \n\n<b>👇Выберите категорию, нажав на кнопку ниже👇</b>"
ADV_STATE_TEXT = "Какой тип рекламного сотрудничества вы хотите предложить?"
QUESTION_STATE_TEXT = "<b>Есть два формата вопросов в редакцию:</b>\n\n<b>- 🙋Публичный вопрос</b>\nВы можете задать любой вопрос касаемо путешествий, программ лояльности, миль да и вообще всего, что обсуждается в канале. И если вопрос окажется досаточно универсальным, интересным или частозадаваемым — я дам на него ответ в канале. Пожалуйте, убедитесь, что ответ на этот вопрос уже не был дан в канале или не находится на первой странице гугла.\n <b>- 🙈Частная консультация</b>\nВот тут уже можно рассмотреть ваш конкретный случай. Даже если он банальный, рутинный или просто приватный. Например, если надо найти билеты в экзотичесих условиях по редким направлениям. Или вам нужен билет в бизнесе по конкретному направлению, и вы хотите делегировать мильные разбирательства. Вот для таких вопросов — кнопочка «Частная консультация»\n\n<b>👉Выберите тип вопроса кнопкой ниже</b>"
SERVICE_STATE_TEXT = "👉Выберите категорию запроса"
ISSUE_STATE_TEXT = "👉Выберите категорию проблемы"
OTHER_INQUIRIES_STATE_TEXT = "Здесь можно передать любое сообщение, которое не подходит ни под одну категорию.\nТакие сообщения рассматриваются с самым низким приоритетом\n\n<b>👇Введите ваше обращение ниже:</b>"

# Advertisement replies
ADV_OFFER_STATE_TEXT = "<b>🤝Спасибо за интерес к моему каналу</b>\nДоступные форматы и цены на даный момент такие:\n\n - 1/24 — 9800 р\n - 2/48 — 10900 р\n - 3/72 — 12800 р\n - Нативный — по договорённости в зависимости от времени в топе и в ленте\n\nВсе цены включают налоги, возможно оформление через чеки/счета самозанятого или по инвойсу на LLC\nОплата возможна на рассчётный счёт или по СБП (для СЗ) или SWIFT с комиссией OUR и по курсу ЦБ на день оплаты (для LLC)\nПосты обязательно помечаются тегом #реклама либо erid'ом с вашей стороны\nПо умолчанию комментарии к рекламным постам отключены, но по договорённости могут быть оставлены\nЕсли условия вам подходят, оставьте ниже сообщение, в котором укажите желаемый формат и предпочтительные временные слоты:  "
SPECIAL_OFFER_STATE_TEXT = "<b>🤝Благодарю за интерес к моему каналу!</b>\nСпецпроекты - мой любимый формат. Пожалуйста, оставьте ниже сообщение с кратким брифом и я скоро вернусь с предварительной оценкой"
ADV_IN_OFFER_TEXT = "Спасибо, но я не закупаю рекламу"

# Questions replies
PUBLIC_QUESTION_TEXT = "Введите вопрос ниже и отправьте боту 👇"
PRIVATE_CONSULTATION_TEXT = "<b>🙅Я сейчас не даю частные консультации в виду большой занятости.</b>\nЯ напишу в канале, когда это поменяется"

# Services replies
BOOK_HOTEL_TEXT = "<b>🛎️Здесь можно забронировать отели по агентским тарифам</b>\n\n🎩Специальные тарифы есть, как правило, лишь в топовых брендах сетевых отелей. Краткий и неполный список участвующих брендов есть в этом посте: https://t.me/anton_and_trvl/3710\nКак правило, спецтариф включает:\n- Завтрак на двоих\n- Кредит на траты в отеле в размере $50-150\n- Апгрейд (при наличии доступности)\n- Ранний заезд и поздний выезд (при наличии доступности)\n- Особо тёплое приветствие: welcome gift и открытка от генерального менеджера отеля.\nВ зависимости от бренда, сети и конкретного отеля набор преимуществ может меняться.\n\n😎Да, и что особенно приятно: при бронировании по этим тарифам вы получаете все бонусные поинты, ночи и преимущества от статуса в сети, если он у вас есть. Бронирование через агента приравнено к бронированию через официальный канал. А в некоторых сетях (например, Hilton) ваши поинты за стей даже удваиваются!\n\n👇Отправьте в бота название отеля и даты, где вы бы хотели забронировать отель по агентскому тарифу. И я отвечу доступными опциями.\n\n👇Кроме этого, я могу для вас поискать отели с такими тарифами во всём городе. В этом случае, пожалуйста, вместе с датами и городом укажите предпочтения по сетям, брендам и верхний потолок цены. "
ORDER_STATUS_TEXT = "<b>✨Здесь будут актуальный предложения по получению статусов</b> отельных сетей, авиакомпаний и круизных компаний\n\n<b>Доступные предложения сейчас:</b>\n - <a href='https://t.me/anton_and_trvl/3056'>Radisson VIP + Avolta Platinum</a>\n - MSC Diamond\n\n👇Выберите вариант, нажав кнопку ниже: "
ORDER_STATUS_CERTAIN_TEXT = "👇Отправьте боту любое сообщение, и я отвечу подробными условиями"
ORDER_STATUS_RECEIVED_TEXT = "✅Спасибо, запрос получен. Отвечу подробными условиями в ближайшее время"
ORDER_LOUNGE_TEXT = "<b>🛋️Здесь будут продаваться мои лишние проходки в бизнес-залы</b>\nСейчас доступных проходок нет"

# Issue replies
PROBLEM_TEXT = "👇Опишите проблему:"
PROBLEM_RECEIVED_TEXT = "🙏Спасибо, я постараюсь исправить это как можно скорее"

# Final state replies
NO_INPUT = "✋Сначала выберите тему обращения. Чтобы увидеть список тем, нажмите /start"
ADV_OFFER_RECEIVED_TEXT = "✅Спасибо, предложение получено. Я скоро на него отвечу."
INQUIRY_SENT_TEXT = "<b>👌Готово, вопрос отправлен.</b>\nЕсли он требует ответа, то ответ придёт сюда же, в диалог с ботом."
HOTEL_REQUEST_RECEIVED_TEXT = "<b>👌Заявка на бронирование принята!</b>\nЯ скоро отвечу доступными вариантами и ценами"
ERROR_TEXT = "🛑Произошла ошибка, попробуйте позже"
INQUIRY_CLOSED = "<b>👌Обращение закрыто</b>\nВозвращаю в Главное Меню"
NO_TOPIC_TO_CLOSE = "🤷Сейчас нет открытых обращений, пока нечего закрывать"
DUPLICATED_ERROR = "✋Сейчас уже есть обращение в работе. Дождитесь его разрешения или закройте самостоятельно командой /close\nДополнить существующее обращение можно отправив любое сообщение боту"
UR_BANNED = "😵Вы заблокированы. Сообщение не было обработано."

# Access control
UNAUTHORIZED_ACCESS_ALERT = "🚫Попытка доступа от неавторизованного пользователя\nID: {user_id}\nИмя: {user_name}\nUsername: @{username}"

# Topic name templates
IN_ADV_TOPIC = "📢Предложение рекламной интеграции от {user_name} [id={user_id}]"
IN_SPECIAL_TOPIC = "⭐️Предложение спецпроекта от {user_name} [id={user_id}]"
PUBLIC_QUESTION_TOPIC = "🙋Публичный вопрос от {user_name} [id={user_id}]"
HOTEL_REQUEST_TOPIC = "🛎️Запрос бронирования отеля от {user_name} [id={user_id}]"
AVOLTA_TOPIC = "😎Запрос статуса Avolta от {user_name} [id={user_id}]"
MSC_TOPIC = "🚢Запрос статуса MSC от {user_name} [id={user_id}]"
ISSUE_BOT_TOPIC = "🤖Проблема с ботом от {user_name} [id={user_id}]"
ISSUE_ROUTES_TOPIC  = "✈️Проблема с routes.de1337ed.ru от {user_name} [id={user_id}]"
ISSUE_TYPO_TOPIC  = "✍️Опечатка/неточность от {user_name} [id={user_id}]"
OTHERS_TOPIC = "🌀Иное от {user_name} [id={user_id}]"

# First message in a new topic
USER_CARD = "👤<b>{full_name}</b>\nНик: {username}\nПрофиль: {profile_link}\nID: <code>{user_id}</code>"
USER_CARD_NO_USERNAME = "нет"
USER_CARD_PROFILE_LINK_TEXT = "открыть"
