# Buttons
ADV_BUTTON_TEXT = "📢Реклама"
QUESTION_BUTTON_TEXT = "🙋‍♂️Задать вопрос"
SERVICES_BUTTON_TEXT = "🛎️Отели, статусы, лаунжи"
REPORT_BUTTON_TEXT = "🤖Сообщить о проблеме"
OTHER_BUTTON_TEXT = "🌀Прочее"
ADV_OFFER_BUTTON_TEXT = "📥Хотим разместиться у вас (узнать условия)"
SPECIAL_OFFER_BUTTON_TEXT = "⭐️Хотим предложить спецпроект"
ADV_IN_CHANNEL_BUTTON_TEXT = "📤Хотим предложить размещение в своём канале"
PUBLIC_QUESTION_BUTTON_TEXT = "🙋Публичный вопрос"
PRIVATE_CONSULTATION_BUTTON_TEXT = "🙈Частная консультация"
BOOK_HOTEL_BUTTON_TEXT = "🛎️Забронировать отель по спецтарифу"
ORDER_STATUS_BUTTON_TEXT = "✨️Приобрести статус"
ORDER_LOUNGE_BUTTON_TEXT = "🍸Приобрести проходки в бизнес-залы"
REPORT_BOT_PROBLEM_BUTTON_TEXT = "🤖Проблема с ботом Hilton Negotiated Fares"
ROUTES_PROBLEM_BUTTON_TEXT = "✈️Проблема с routes.de1337ed.ru"
TYPO_PROBLEM_BUTTON_TEXT = "✍️Опечатка/неточность в тексте"

# Main menu replies
WELCOME_MESSAGE = "<b>👋Добрый день, {user_name}!</b>\nПожалуйста, выберите категорию обращения"
ADV_STATE_TEXT = "Какой тип рекламного сотрудничества вы хотите предложить?"
QUESTION_STATE_TEXT = "Выберите тип вопроса"
SERVICE_STATE_TEXT = "Выберите категорию"
ISSUE_STATE_TEXT = "Выберите категорию"
OTHER_INQUIRIES_STATE_TEXT = "👇Введите ваше обращение ниже:"

# Advertisement replies
ADV_OFFER_STATE_TEXT = "Благодарю за интерес к моему каналу! Условия сейчас такие...Если условия вам подходят, оставьте ниже сообщение, в котором укажите:  "
SPECIAL_OFFER_STATE_TEXT = "Благодарю за интерес к моему каналу! Спецпроекты - мой любимый формат. Пожалуйста, оставьте ниже сообщение с кратким брифом и я оочень скоро вернусь с предварительной оценкой"
ADV_IN_OFFER_TEXT = "Спасибо, но я не закупаю рекламу"

# Questions replies
PUBLIC_QUESTION_TEXT = "Введите вопрос ниже и отправьте боту 👇"
PRIVATE_CONSULTATION_TEXT = "<b>🙅Я сейчас не даю частные консультации в виду большой занятости.</b>\nЯ напишу в канале, когда это поменяется"

# Services replies
BOOK_HOTEL_TEXT = "Скоро здесь можно будет забронировать отели по агентским тарифам"
ORDER_STATUS_TEXT = "Здесь будут актуальный предложения по получению статусов отельных сетей, авиакомпаний и круизных компаний. Сейчас доступных предложений нет."
ORDER_LOUNGE_TEXT = "Здесь будут продаваться мои лишние проходки в бизнес-залы. Сейчас доступных проходок нет"

# Issue replies
PROBLEM_TEXT = "👇Опишите проблему:"

# Final state replies
NO_INPUT = "Сначала выберите тему обращения. Чтобы увидеть список тем, нажмите /start"
ADV_OFFER_RECEIVED_TEXT = "✅Спасибо, предложение получено. Я скоро на него отвечу."
INQUIRY_SENT_TEXT = "Готово, вопрос отправлен. Ответ придёт сюда же, в диалог с ботом."
ERROR_TEXT = "Произошла ошибка, попробуйте позже"

# Topic name templates
IN_ADV_TOPIC = "📢Предложение рекламной интеграции от {user_name} [id={user_id}]"
IN_SPECIAL_TOPIC = "⭐️️Предложение спецпроекта от {user_name} [id={user_id}]"
PUBLIC_QUESTION_TOPIC = "🙋Публичный вопрос от {user_name} [id={user_id}]"
ISSUE_BOT_TOPIC = "🤖Проблема с ботом от {user_name} [id={user_id}]"
ISSUE_ROUTES_TOPIC  = "✈️Проблема с routes.de1337ed.ru от {user_name} [id={user_id}]"
ISSUE_TYPO_TOPIC  = "✍️Опечатка/неточность от {user_name} [id={user_id}]"
OTHERS_TOPIC = "🌀Иное от {user_name} [id={user_id}]"
